# -*- coding: utf-8 -*-
"""
Created on Tue Oct 10 22:01:52 2023

@author: maste
"""

#Найдите результат выражения для заданных значений a и b. 
#Учитывайте регистр символов при ответе.

a = True
b = False
print(a and b or not a and not b)